<template>
    <div v-if="show"><!--由 v-if 所触发的切换，渐变动画-->
        <div class="mulu">
            <!--目录-->
            <ul>
                <li>
                    <div id="d11">简介目录</div>
                </li>
                <div id="d2">
                    <hr size="3" color="gray">
                    <li><a href="#shiming">市名由来</a></li>
                    <li><a href="#huanjin">地理环境</a></li>
                    <li><a href="#lishi">历史沿革</a></li>
                    <li><a href="#ziyuan">自然资源</a></li>
                    <li><a href="#quhua">行政区划</a></li>
                    <li><a href="#renkou">人口民族</a></li>
                </div>
            </ul>
        </div>
        <div class="zhuti">
            <!--主体-->
            <div id="ship">
                <!--宣传视频-->
                <iframe src="//player.bilibili.com/player.html?isOutside=true&aid=261264973&bvid=BV1ie411j7EK&cid=855438214&p=1" scrolling="no" border="0" frameborder="no" framespacing="0" allowfullscreen="true" width="900px" height="400px"></iframe>
                <!--
                这里换成了b站视频，应该替换为本地视频（不知道为什么，卡卡的）
                src: 视频路径
                width: 视频宽度
                height: 视频高度
                autoplay: 是否自动播放
                controls: 是否显示控制条
                @timeupdate: 视频播放时触发(获取视频播放的时间)-->
            </div>
            <div id="shiming">
                <!--市名介绍-->
                <img src="../img/shiming.jpg">
                <h4><a name="shiming">市名由来：</a></h4>
                <p>
                    保定，古称上谷、保州、保府，又名靴城，河北省辖地级市，国务院批复确定的京津冀地区中心城市之一，保定与北京相伴而生，保定之名取自“保卫大都，安定天下”，与北京、天津构成黄金三角，自古是“北控三关，南达九省，地连四部，雄冠中州”的通衢之地，历来为京畿重地和“首都南大门”。
                </p>
            </div>

            <div id="dili">
                <!--地理环境介绍-->
                <img src="../img/dili.jpg">
                <h4><a name="huanjin">地理环境:</a></h4>
                <p>
                    保定市位于河北省中部偏西，太行山东麓，冀中平原西部，地理坐标介于北纬38°14′29″~39°57′3″，东经113°45′32″~116°19′41″之间；东接雄安新区，东南邻沧州市任丘市、河间市、肃宁县，南界衡水市安平县，西南连石家庄市深泽县、无极县、行唐县、灵寿县、新乐市，西靠山西省五台县、繁峙县、灵丘县，西北与山西省广灵县及张家口市蔚县、涿鹿县交界，北邻北京市房山区，东北与廊坊市固安县毗邻。
                    [44]保定市中心距北京140千米，距天津145千米，距石家庄125千米，与京津成三足鼎立之势，为雄安新区战略腹地。总面积2.2万平方千米（现有管辖范围为1.93万平方千米），其中市区面积2531平方千米。
                    [38]
                </p>
                <br>
                <h5>地形地貌：</h5>
                <p>
                    保定市地处太行山北部东麓，冀中平原西部，地势由西北向东南倾斜。地貌分为山区和平原两大类。山区分为中山区、低山区及丘陵三类。平原区按成因分山前洪积平原、冲积平原及洼淀区三部分。境内最高峰歪头山位于阜平县，海拔2286米；最低点洼淀区位于白洋淀和周边低洼易涝区，海拔7米。
                    [44]以黄海高程100米等高线划分，山区面积10988.1平方千米，占总面积的49.7%。平原（含洼地）11124.9平方千米，占总面积的50.3%。
                </p>
                <img src="../img/dilishuiwen.jpg">
                <h5>水文：</h5>
                <p>
                    保定市位于海河流域大清河水系的中上游。大清河上游分为南北两支。北支水系上游为拒马河，自张坊出山口以下分为南、北拒马河。北拒马河在涿州市境内有胡良河、琉璃河、小清河汇入后称白沟河；南拒马河在定兴北河店有北易水、中易水汇入，白沟河、南拒马河在白沟新城汇流，以下称大清河。北支洪水经新盖房枢纽分别由白沟引河入白洋淀和新盖房分洪道入东淀。南支水系有潴龙河、唐河、孝义河、府河、漕河、萍河等，均汇入白洋淀，南支洪水经白洋淀下口的枣林庄枢纽入东淀。大清河水系流域面积4.3万平方千米，白洋淀以上流域面积3.1万平方千米。境内水系的最大特点是呈扇形分布，自成水系。
                </p>
                <h5>气候：</h5>
                <p>
                    保定市属暖温带大陆性季风气候区，主要气候特点是：四季分明，春季干燥多风，夏季炎热多雨，雨、热同季，秋季天高气爽，冬季寒冷干燥。多年平均气温13.4℃，1月平均气温-4.3℃，7月平均气温26.4℃。生长期年平均280天，无霜期年平均211天，最长达231天（1982年），最短为168天（1991年）。年平均日照时数2511小时。年平均降水量498.9毫米，年平均降水日数为68天；降水集中在每年6~8月，7月最多。年平均风速1.8米/秒。年平均蒸发量为1430.5毫米。
                </p>
            </div>
            <div id="lishi">
                <!--历史介绍-->
                <img src="../img/lishi.jpg">
                <h4><a name="lishi">历史沿革：</a></h4>
                <p>
                    保定市位于河北省中部，历史上曾是重要的军事和商业重镇。其历史沿革可以追溯到夏商时期，当时保定地区属于范国。春秋战国时期，保定地区被分割为多个小国，其中最有名的是齐国。秦汉时期，保定地区先后属于涿郡和安平郡。北魏时期，清苑县设立，是保定设县的开始。隋唐时期，清苑县曾改名为乐乡县，后又被改回清苑县。北宋时期，保塞军的设立标志着保定的行政级别提升。元朝时期，顺天路的设立使“保定”之名开始沿用至今。明清时期，保定仍沿旧制设立保定府。民国时期，保定市辖区经历了多次变革。现代的保定市是河北省的重要城市之一，为河北的政治、经济、文化、教育、军事中心。
                </p>

            </div>
            <div id="ziyuan">
                <!--资源介绍-->
                <h4><a name="ziyuan">自然资源：</a></h4>
                <h5>矿产资源：</h5>
                <p>
                    保定市境内矿产资源主要分布在山区9县，截至2015年，保定市已发现矿产77种，已探明储量的59种，开发利用33种，主要矿种有煤、铁、金、铜、铅、锌、钼、花岗岩、大理石、石灰石、陶瓷原料等金属及非金属矿产。其中煤矿5个矿区，保有资源储量1.56亿吨；铁矿20个矿区，保有资源储量2.25亿吨；钛矿3个矿区，保有资源储量69.45万吨；铜矿7个矿区，保有资源储量（金属量）86.94万吨；铅矿5个矿区，保有资源储量（金属量）11.58万吨；锌矿12个矿区，保有资源储量（金属量）94.74万吨；钼矿6个矿区，保有资源储量（金属量）36.14万吨；金矿13个矿区；银矿12个矿区，保有资源储量（金属量）996.11吨；熔剂用灰岩1个矿区，保有资源储量550万吨；冶金用白云岩2个矿区，保有资源储量1.001亿吨；石棉1个矿区，保有资源储量208吨；云母3个矿区，保有资源储量32.09万吨；水泥用灰岩9个矿区，保有资源储量4.05亿吨。
                </p>
                <img src="../img/ziyuanzhiwu.jpg">
                <h5>植物资源</h5>
                <p>
                    保定市山地林木为落叶林、乔木，主要有桦、杨、落叶松、油松、侧柏、栎类等。山麓和山沟有枣、柿、花椒、杏、核桃、山里红等经济林木。灌木主要有胡枝子、虎榛子、酸枣、荆条等。丘陵和平原主要有用材林和经济林。白洋淀附近主要生长水生沼泽植物。
                </p>
                <h5>动物资源</h5>
                <p>
                    保定市的动物资源丰富，包括湿地动物和森林动物等。湿地动物广泛分布于全市大小河流、库塘、沼泽和淀洼之中，包括鸟类、鱼类、两栖爬行类、节肢类和软体类等。其中，鸟类资源丰富，有国家一级和二级重点保护鸟类以及数量众多的省重点保护鸟类。鱼类资源也相当丰富，以鲤鱼、黑鱼、黄颡鱼为主，其中以鲤科种类最多。此外，还有两栖爬行、节肢和软体动物等。森林动物则包括东北虎、黑熊、梅花鹿等几十种稀有的野生动物。
                </p>
                <img src="../img/ziyuanshui.jpg">
                <h5>水资源：</h5>
                <p>
                    保定市多年平均地表水资源量16.20亿立方米，多年平均地下水资源量22.23亿立方米，多年平均水资源总量29.78亿立方米，多年平均入境水量6.32亿立方米。
                </p>
            </div>
            <div id="quhua">
                <!--区域划分-->
                <h4><a name="quhua">行政区划：</a></h4>
                <p>
                    截至2023年8月，保定市辖5区、12县（不含雄安新区）、代管4市（其中定州为省直管试点），另设1个国家级高新区、1个副地级白沟新城，市政府驻竞秀区东风西路1号。
                </p>
                <img src="../img/quhua.jpg">
            </div>
            <div id="renkou">
                <h4><a name="renkou">人口民族</a>：</h4>
                <!--人口介绍-->
                <h5>人口：</h5>
                <p>截至2022年末，保定市常住人口914.4万人，其中，城镇常住人口540.2万人，比上年末增加2.8万人；城镇化率59.08%，比上年末提高0.63个百分点。（不含雄安新区及定州）</p>
                <h5>民族</h5>
                <p>
                    保定市境内主要民族为汉族，有少数民族回族、满族、蒙古族、壮族、土家族等49个民族。
                </p>
            </div>
        </div>
        <div class="mar1">
            <marquee direction="down" width="100%" height="50" behavior="alternate" style="border:solid">
                <marquee behavior="alternate">Welcome to BaoDing||保定欢迎您!</marquee>
            </marquee>
        </div>
        <div class="footer">
            <!--页尾-->
            <p>
                &nbsp;
            </p>
            <p><!--尾页文字-->
                千年京畿第一府，自然山水保定城。
            </p>
        </div>
    </div>
</template>

<script>
import "../css/jianjie.css"
export default {
    name: "IntroductionA",
    data() {
        return {
            show: false,
        };
    },
    mounted() {
        setTimeout(() => {
            this.show = true;
        }, 500);
    },
};
</script>
